Revit 2027 API
FillGrid.CalculateLinesPerLength Method
 Calculates the number of solid lines of the pattern per unit length.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CalculateLinesPerLength()
Public Function CalculateLinesPerLength As Double
public:
double CalculateLinesPerLength()
member CalculateLinesPerLength : unit -> float
Return Value
Double
 The solid lines per length.
See Also
Reference
FillGrid Class
Autodesk.Revit.DB Namespace